
**@flexwie suggests the following changes in this pull_request:**  

```terraform

Acquiring state lock. This may take a few moments...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # hcloud_server.node1 will be created
  + resource "hcloud_server" "node1" {
      + backup_window      = (known after apply)
      + backups            = false
      + datacenter         = (known after apply)
      + delete_protection  = false
      + firewall_ids       = (known after apply)
      + id                 = (known after apply)
      + image              = "ubuntu-20.04"
      + ipv4_address       = (known after apply)
      + ipv6_address       = (known after apply)
      + ipv6_network       = (known after apply)
      + keep_disk          = false
      + location           = "nbg1"
      + name               = "node1"
      + rebuild_protection = false
      + server_type        = "cx11"
      + status             = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: iaac.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "iaac.tfplan"
Releasing state lock. This may take a few moments...

```

